Билет_сервер/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.Графики</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет_сервер/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.КоличествоЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

Билет_сервер/src/InformationRegisters/СведенияОСотрудниках/СведенияОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОСотрудниках</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Билет_сервер/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ВечерниеЧасы</name>
      <description>Вечерние часы</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Билет_сервер/src/Documents/НачислениеЗарплаты/ObjectModule.bsl
// Обработка проведения.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  РежимПроведения - РежимПроведенияДокумента - Режим проведения
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ОсновныеНачисления.Записывать=Истина;
	Движения.ОсновныеНачисления.Очистить();

	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	НАЧАЛОПЕРИОДА(НачислениеЗарплатыОсновныеНачисления.Ссылка.Дата, МЕСЯЦ) КАК ПериодРегистрации,
				  |	НачислениеЗарплатыОсновныеНачисления.Сотрудник,
				  |	НачислениеЗарплатыОсновныеНачисления.Подразделение,
				  |	НачислениеЗарплатыОсновныеНачисления.График,
				  |	НачислениеЗарплатыОсновныеНачисления.ВидРасчета,
				  |	НачислениеЗарплатыОсновныеНачисления.ДатаНачала КАК ПериодДействияНачало,
				  |	НачислениеЗарплатыОсновныеНачисления.ДатаОкончания КАК ПериодДействияКонец,
				  |	НАЧАЛОПЕРИОДА(НачислениеЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ) КАК НачалоРасчетногоПериода
				  |ПОМЕСТИТЬ ТабЧастьОкладВечерниеЧасы
				  |ИЗ
				  |	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
				  |ГДЕ
				  |	НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
				  |	И (НачислениеЗарплатыОсновныеНачисления.ВидРасчета = &ВидРасчетаОклад
				  |			ИЛИ НачислениеЗарплатыОсновныеНачисления.ВидРасчета = &ВидРасчетаВечерниеЧасы)
				  |;
				  |
				  |////////////////////////////////////////////////////////////////////////////////
				  |ВЫБРАТЬ
				  |	ТабЧастьОкладВечерниеЧасыСМаксПериодом.ПериодРегистрации,
				  |	ТабЧастьОкладВечерниеЧасыСМаксПериодом.Сотрудник,
				  |	ТабЧастьОкладВечерниеЧасыСМаксПериодом.Подразделение,
				  |	ТабЧастьОкладВечерниеЧасыСМаксПериодом.График,
				  |	ТабЧастьОкладВечерниеЧасыСМаксПериодом.ВидРасчета,
				  |	ТабЧастьОкладВечерниеЧасыСМаксПериодом.ПериодДействияНачало,
				  |	ТабЧастьОкладВечерниеЧасыСМаксПериодом.ПериодДействияКонец,
				  |	СведенияОСотрудниках.Оклад КАК Параметр,
				  |	NULL КАК БазовыйПериодНачало,
				  |	NULL КАК БазовыйПериодКонец
				  |ИЗ
				  |	(ВЫБРАТЬ
				  |		ТабЧастьОкладВечерниеЧасы.ПериодРегистрации КАК ПериодРегистрации,
				  |		ТабЧастьОкладВечерниеЧасы.Сотрудник КАК Сотрудник,
				  |		ТабЧастьОкладВечерниеЧасы.Подразделение КАК Подразделение,
				  |		ТабЧастьОкладВечерниеЧасы.График КАК График,
				  |		ТабЧастьОкладВечерниеЧасы.ВидРасчета КАК ВидРасчета,
				  |		ТабЧастьОкладВечерниеЧасы.ПериодДействияНачало КАК ПериодДействияНачало,
				  |		ТабЧастьОкладВечерниеЧасы.ПериодДействияКонец КАК ПериодДействияКонец,
				  |		ТабЧастьОкладВечерниеЧасы.НачалоРасчетногоПериода КАК НачалоРасчетногоПериода,
				  |		МАКСИМУМ(СведенияОСотрудниках.Период) КАК МаксимальныйПериод
				  |	ИЗ
				  |		ТабЧастьОкладВечерниеЧасы КАК ТабЧастьОкладВечерниеЧасы
				  |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСотрудниках КАК СведенияОСотрудниках
				  |			ПО ТабЧастьОкладВечерниеЧасы.Сотрудник = СведенияОСотрудниках.Сотрудник
				  |				И ТабЧастьОкладВечерниеЧасы.Подразделение = СведенияОСотрудниках.Подразделение
				  |				И ТабЧастьОкладВечерниеЧасы.НачалоРасчетногоПериода >= СведенияОСотрудниках.Период
				  |	
				  |	СГРУППИРОВАТЬ ПО
				  |		ТабЧастьОкладВечерниеЧасы.ПериодДействияКонец,
				  |		ТабЧастьОкладВечерниеЧасы.ПериодДействияНачало,
				  |		ТабЧастьОкладВечерниеЧасы.НачалоРасчетногоПериода,
				  |		ТабЧастьОкладВечерниеЧасы.Подразделение,
				  |		ТабЧастьОкладВечерниеЧасы.График,
				  |		ТабЧастьОкладВечерниеЧасы.ВидРасчета,
				  |		ТабЧастьОкладВечерниеЧасы.ПериодРегистрации,
				  |		ТабЧастьОкладВечерниеЧасы.Сотрудник) КАК ТабЧастьОкладВечерниеЧасыСМаксПериодом
				  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСотрудниках КАК СведенияОСотрудниках
				  |		ПО ТабЧастьОкладВечерниеЧасыСМаксПериодом.Сотрудник = СведенияОСотрудниках.Сотрудник
				  |			И ТабЧастьОкладВечерниеЧасыСМаксПериодом.Подразделение = СведенияОСотрудниках.Подразделение
				  |			И ТабЧастьОкладВечерниеЧасыСМаксПериодом.МаксимальныйПериод = СведенияОСотрудниках.Период
				  |
				  |ОБЪЕДИНИТЬ ВСЕ
				  |
				  |ВЫБРАТЬ
				  |	НАЧАЛОПЕРИОДА(НачислениеЗарплатыОсновныеНачисления.Ссылка.Дата, МЕСЯЦ),
				  |	НачислениеЗарплатыОсновныеНачисления.Сотрудник,
				  |	НачислениеЗарплатыОсновныеНачисления.Подразделение,
				  |	ЗНАЧЕНИЕ(Справочник.Графики.Пятидневка),
				  |	НачислениеЗарплатыОсновныеНачисления.ВидРасчета,
				  |	НачислениеЗарплатыОсновныеНачисления.ДатаНачала,
				  |	НачислениеЗарплатыОсновныеНачисления.ДатаОкончания,
				  |	NULL,
				  |	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НачислениеЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ, -2), МЕСЯЦ),
				  |	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НачислениеЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
				  |ИЗ
				  |	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
				  |ГДЕ
				  |	НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
				  |	И НачислениеЗарплатыОсновныеНачисления.ВидРасчета = &ВидРасчетаКомандировка";

	Запрос.УстановитьПараметр("Ссылка", ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ВидРасчетаКомандировка", ПланыВидовРасчета.ОсновныеНачисления.Командировка);
	Запрос.УстановитьПараметр("ВидРасчетаВечерниеЧасы", ПланыВидовРасчета.ОсновныеНачисления.ВечерниеЧасы);

	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение=Движения.ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;

	СторноЗаписи=Движения.ОсновныеНачисления.ПолучитьДополнение();
	Для Каждого Запись Из СторноЗаписи Цикл
		Движение=Движения.ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
		Движение.ПериодДействияНачало=Запись.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец=Запись.ПериодДействияКонецСторно;
		Движение.ПериодРегистрации=Запись.ПериодРегистрацииСторно;
		Движение.Сторно=Истина;
	КонецЦикла;

	Движения.Записать();

	Расчет.РассчитатьНачисления(Ссылка);
	
КонецПроцедуры
